INSERT INTO app_users (id, login, email, age, created_at, updated_at, deleted_at, city) VALUES
(1, 'user1', 'user1@example.com', 25, '2023-10-01 10:00:00', '2023-10-01 10:00:00', NULL, 'Москва'),
(2, 'user2', 'user2@example.com', 30, '2023-10-01 10:01:00', '2023-10-01 10:01:00', NULL, 'Санкт-Петербург'),
(3, 'user3', 'user3@example.com', 22, '2023-10-01 10:02:00', '2023-10-01 10:02:00', NULL, 'Новосибирск'),
(4, 'user4', 'user4@example.com', 35, '2023-10-01 10:03:00', '2023-10-01 10:03:00', NULL, 'Екатеринбург'),
(5, 'user5', 'user5@example.com', 28, '2023-10-01 10:04:00', '2023-10-01 10:04:00', NULL, 'Казань'),
(6, 'user6', 'user6@example.com', 26, '2023-10-01 10:05:00', '2023-10-01 10:05:00', NULL, 'Нижний Новгород'),
(77, 'user7', 'user7@example.com', 33, '2023-10-01 10:06:00', '2023-10-01 10:06:00', NULL, 'Самара'),
(88, 'user8', 'user8@example.com', 29, '2023-10-01 10:07:00', '2023-10-01 10:07:00', NULL, 'Омск'),
(9, 'user9', 'user9@example.com', 27, '2023-10-01 10:08:00', '2023-10-01 10:08:00', NULL, 'Челябинск'),
(10, 'user10', 'user10@example.com', 31, '2023-10-01 10:09:00', '2023-10-01 10:09:00', NULL, 'Ростов-на-Дону');
